app/controllers/kba_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."place_of_birth" = $1 AND "users"."favorite_music" = $2 LIMIT 1  [["place_of_birth", ""], ["favorite_music", "rock"]]
---
def create

user= User.find_by(place_of_birth: params[:kba][:place_of_birth]) ||  User.find_by(date_of_birth: params[:kba][:date_of_birth]) || User.find_by(favorite_sport: params[:kba][:favorite_sport]) || User.find_by(favorite_music: params[:kba][:favorite_music])