app/controllers/sessions_controller.rb

def create
    user = User.find_by(email: params[:session][:email].downcase, favorite_sport: params[:session][:favorite_sport] )
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 AND "users"."favorite_sport" = $2 LIMIT 1  [["email", "enriquezlucho@yahoo.com"], ["favorite_sport", ""]]